sql/message-load-test.yaml
config:
  target: "http://localhost:3000/sql"
  phases:
    - duration: 300
      arrivalRate: 1000
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./generateNames.js"
scenarios:
  - flow:
      - post:
          beforeRequest: "generateName"
          url: "/message"
          json:
            content: "Test message"
            name: "{{name}}"